#@ # 
#@ # Running icc2_shell Version R-2020.09-SP6 for linux64 -- May 17, 2021
#@ # Date:   Thu Aug  8 11:34:28 2024
#@ # Run by: rmolina003@redhat003
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
open_lib /mnt/vol_NFS_rh003/profesores/rmolina/Digital_Designs/Phy_Impl/SPI_RFID/back_end/spi_io_module.ndm -edit
open_lib /mnt/vol_NFS_rh003/profesores/rmolina/Digital_Designs/Phy_Impl/SPI_RFID/back_end/spi_io_module_lib -edit
open_block /mnt/vol_NFS_rh003/profesores/rmolina/Digital_Designs/Phy_Impl/SPI_RFID/back_end/spi_io_module_lib:spi_io_module/post_lvs.design
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetX} -value {0.005}
gui_set_pref_value -category {showRelativeLocationConstraints} -key {macroOffsetY} -value {0.005}
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class routing_blockage -layer {136-170}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class shape -filter {} -layer {136-170}
win_set_filter -visible -class via -filter {} -layer {136-170}
win_set_filter -visible -class terminal -filter {}  -layer {136-170}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-171}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class routing_blockage -layer {136-170}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class shape -filter {} -layer {136-170}
win_set_filter -class via -filter {} -layer {136-170}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-171}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
link_block
